{"custom.error": "Error: This capability allows the device to report and set error conditions.\nAttributes:\n    error: It represents the current error status of the device.\n\nCommands:\n    setError: This command allows you to set an error condition on the device.\n        Args:\n            error: This argument is used to specify the error condition to be set on the device.", "custom.picturemode": "PictureMode: A capability that allows control over the picture mode settings of a device.\nAttributes:\n    pictureMode: Represents the current picture mode of the device.\n    supportedPictureModes: Lists all the picture modes supported by the device.\n    supportedPictureModesMap: Provides a map of all supported picture modes including their names and corresponding values.\nCommands:\n    setPictureMode: Changes the picture mode of the device.\n        Args:\n            mode: Specifies the picture mode to be set.", "custom.soundmode": "SoundMode: This capability allows the control and monitoring of the sound mode settings of a device.\nAttributes:\n    supportedSoundModesMap: Provides a map of the supported sound modes that the device can utilize.\n    soundMode: Indicates the current sound mode setting of the device.\n    supportedSoundModes: Lists all the sound modes that the device supports.\n\nCommands:\n    setSoundMode: Changes the device's sound mode to the specified setting.\n        Args:\n            mode: The sound mode setting to apply to the device.", "custom.accessibility": "Accessibility: This capability allows the device to manage and control accessibility settings.\nAttributes: \n  No defined attributes for this capability.\n\nCommands:\n    setAccessibility: This command sets the accessibility settings for the device.\n        Args:\n            menuName: Specifies the name of the accessibility menu to be set.\n            menuId: Indicates the identification number of the accessibility menu to be set.\n            option: Defines the specific accessibility option to be set within the menu.", "custom.launchapp": "launchApp: This capability facilitates the launching of a specific application on a device.\nAttributes:\n    No attributes in this capability.\nCommands:\n    launchApp: This command initiates the process of opening a specified application.\n        Args:\n            appId: This argument represents the unique identifier of the application that needs to be launched.\n            appName: This argument denotes the name of the application to be launched.", "custom.recording": "Recording: This capability pertains to devices capable of recording media, such as audio or video.\nAttributes:\n    None\n\nCommands:\n    recordStart: This command initiates the recording process.\n        Args:\n            None\n\n    recordStop: This command halts the recording process.\n        Args:\n            None", "custom.tvsearch": "tvSearch: This capability allows a SmartThings device, such as a smart TV, to perform searches.\n\nAttributes:\n   No specific attributes for this capability.\n\nCommands:\n    search: Initiates a search action on the device.\n        Args:\n            query: Represents the keyword or phrase to search for.\n            url: This could be a specific URL or online source where the device should perform the search.", "custom.disabledCapabilities": "Disabled Capabilities: This capability manages the functionalities of the device that are currently disabled.\nAttributes:\n    disabledCapabilities: Represents the features of the device that are not currently enabled or in use.\n\nCommands: \n    There are no specific commands associated with this capability.", "samsungvd.remoteControl": "Remote Control: This capability allows a device to interact and control other devices remotely.\nAttributes: \n    No specific attributes are documented for this capability.\n\nCommands:\n    send: This command is used to send control signals to the target device.\n        Args:\n            keyValue: This argument represents the specific control instruction or value to be sent.\n            keyState: This argument represents the state of the command being sent.", "samsungvd.ambient": "Ambient: This capability allows control and interaction with ambient devices.\nAttributes:\n    No attributes available for this capability.\n\nCommands:\n    setAmbientOn: This command enables the ambient functionality of the device.\n        Args:\n            No arguments available for this command.", "samsungvd.ambientContent": "Ambient Content: This capability allows the control and management of ambient content on a device. \n\nAttributes:\n    supportedAmbientApps: This attribute lists the apps that are supported for displaying ambient content on the device.\n\nCommands:\n    setAmbientContent: This command sets the ambient content to be displayed on the device.\n        Args:\n            id: This argument specifies the identifier of the ambient content to be displayed.", "samsungvd.ambient18": "Ambient18: This capability manages and controls ambient settings of a device.\nAttributes: \n    (No attributes available for this capability)\nCommands:\n    setAmbientOn: This command is used to turn on the ambient feature of the device.\n        Args:\n            (No arguments available for this command)", "samsungvd.mediaInputSource": "Media Input Source: This capability allows a device to manage and set different media input sources.\n\nAttributes:\n    supportedInputSourcesMap: This attribute represents a mapping of all supported media input sources by the device.\n    inputSource: This attribute indicates the currently active media input source on the device.\n\nCommands:\n    setInputSource: This command allows you to set a specific media input source on the device.\n        Args:\n            id: Represents the identifier of the media input source you wish to set on the device.", "samsungvd.firmwareVersion": "Firmware Version: This capability is related to managing and updating the firmware version of a SmartThings device.\nAttributes:\n    firmwareVersion: This attribute represents the current firmware version installed on the device.\nCommands:\n    setFirmwareVersion: This command is used to update or set the firmware version of the device.\n        Args:\n            version: This argument specifies the new firmware version to be set.", "samsungvd.supportsPowerOnByOcf": "Supports Power On By OCF: This capability indicates whether a device supports being powered on by the Open Connectivity Foundation (OCF) standard.\nAttributes:\n    supportsPowerOnByOcf: This attribute shows if the device supports power on operation by the OCF standard.\nCommands:\n    No specific commands available for this capability.", "sec.diagnosticsInformation": "Diagnostics Information: This capability provides detailed diagnostic information regarding the device.\n\nAttributes:\n    logType: Represents the type of log generated by the device\n    endpoint: Indicates the endpoint used by the device for communication\n    minVersion: Specifies the minimum version of software/firmware required by the device\n    signinPermission: Indicates the permission level required for signing into the device\n    setupId: Identifies the setup process or configuration used by the device\n    protocolType: Specifies the type of protocol used by the device for communication\n    tsId: Represents a unique identifier for the timestamp of the device\n    mnId: Represents a unique identifier for the manufacturer of the device\n    dumpType: Specifies the type of data dump generated by the device for diagnostic purposes\n\nCommands:\n    No specific commands are documented for this capability.", "custom.deviceReportStateConfiguration": "Device Report State Configuration: This capability allows users to configure how a device reports its state, including the frequency and whether it should be reported in real time.\nAttributes:\n    reportStateRealtimePeriod: This attribute represents the period for a device to report its state in real time.\n    reportStateRealtime: This attribute indicates whether the device is set to report its state in real time.\n    reportStatePeriod: This attribute represents the frequency at which the device reports its state.\nCommands:\n    setReportStatePeriod: This command sets the frequency at which the device reports its state.\n        Args:\n            value: This argument sets the value for the report state period.\n    setReportStateRealtime: This command enables or disables real-time state reporting for the device.\n        Args:\n            value: This argument sets the value for the report state in real time (true or false).\n    setReportStateRealtimePeriod: This command sets the period for a device to report its state in real time.\n        Args:\n            value: This argument sets the value for the real-time state report period.", "custom.energyType": "Energy Type: A capability that allows the monitoring and control of a device's energy consumption and saving features.\nAttributes:\n    energySavingSupport: Indicates whether the device supports energy saving functionality.\n    drMaxDuration: Represents the maximum duration of demand response.\n    energyType: Specifies the type of energy used by the device.\n    energySavingLevel: Specifies the current level of energy saving on the device.\n    supportedEnergySavingLevels: Lists the energy saving levels that the device supports.\n    energySavingOperation: Specifies the current operation of the energy saving feature.\n    energySavingOperationSupport: Indicates whether the device supports energy saving operations.\n\nCommands:\n    setEnergySavingLevel: A command that sets the energy saving level of the device.\n        Args:\n            energySavingLevel: The level of energy saving to set on the device.", "custom.fridgeMode": "setFridgeMode\n\tArgs:\n\t\tmode: Specifies the mode to set the fridge in\n\nFridge Mode: This capability enables control over the operating mode of a smart refrigerator.\nAttributes:\n    fridgeModeValue: Indicates the current operating mode of the fridge.\n    fridgeMode: Represents the current mode the fridge is operating in (e.g., normal, vacation, power save).\nCommands:\n    setFridgeMode: Changes the operating mode of the fridge.\n        Args:\n            mode: The desired operating mode for the fridge.", "custom.disabledComponents": "\"Disabled Components\": This capability relates to managing and identifying components of a device that are currently disabled.\nAttributes:\n    disabledComponents: This attribute lists all the components of the device that are currently disabled.\n\nCommands:\n    No commands available for this capability.", "custom.waterFilter": "Water Filter: This capability allows for the monitoring and control of a water filtration system.\nAttributes:\n    waterFilterUsageStep: Indicates the progression or steps in the usage of the water filter.\n    waterFilterResetType: Specifies the type of reset available for the water filter.\n    waterFilterCapacity: Represents the total filtration capacity of the water filter.\n    waterFilterLastResetDate: Logs the most recent date when the water filter was reset.\n    waterFilterUsage: Tracks the current usage status of the water filter.\n    waterFilterStatus: Provides the overall operational status of the water filter.\nCommands:\n    resetWaterFilter: This command allows for the reset of the water filter.\n        Args:\n            No arguments for this command.", "samsungce.softwareUpdate": "Software Update: This capability allows a device to manage and perform software updates.\nAttributes:\n    targetModule: The intended module for the software update.\n    otnDUID: Identifier for over-the-air updates.\n    lastUpdatedDate: The date when the software was last updated.\n    availableModules: List of modules that are available for update.\n    newVersionAvailable: Indicates if a new version of the software is available.\n    operatingState: Represents the current state of the software update process.\n    progress: Indicates the progress of the ongoing software update.\n\nCommands:\n    agreeUpdate: Command to agree and proceed with the update for a specified module.\n        Args:\n            module: The module that the update should be applied to.\n    disagreeUpdate: Command to disagree and halt the update for a specified module.\n        Args:\n            module: The module that the update should not be applied to.", "samsungce.deviceIdentification": "Device Identification: This capability allows the identification of a device by providing attributes such as model name, serial number and other identifying details.\n\nAttributes:\n    micomAssayCode: The code pertaining to the device's internal assay, often used for testing or calibration purposes.\n    modelName: The name of the particular model of the device.\n    serialNumber: The unique serial number assigned to the device for identification.\n    serialNumberExtra: Any additional serial numbers associated with the device.\n    modelClassificationCode: A code that categorizes the model of the device.\n    description: A brief description of the device.\n    binaryId: A binary identifier for the device, often used in digital communications or data storage.\n\nCommands:\n    This capability does not have any associated commands as it's primarily used for identification and classification purposes.", "samsungce.driverVersion": "Driver Version: This capability pertains to the version number of a device driver.\nAttributes:\n    versionNumber: Represents the version number of the device driver.\nCommands:\n    No commands are available for this capability.", "samsungce.powerCool": "Power Cool: This capability is related to cooling devices that have a power cool function, which allows for rapid cooling.\nAttributes:\n    activated: Indicates whether the power cool function is currently active or not.\nCommands:\n    activate: Activates the power cool function.\n        Args: None\n    deactivate: Deactivates the power cool function.\n        Args: None", "samsungce.powerFreeze": "Power Freeze: This capability allows devices to enter a power freeze mode, often used in appliances like refrigerators to rapidly lower temperature.\nAttributes:\n    activated: Indicates if the power freeze mode is currently active or not.\n\nCommands:\n    activate: Command to activate the power freeze mode. No arguments required.\n    deactivate: Command to deactivate the power freeze mode. No arguments required.", "samsungce.viewInside": "View Inside: This capability allows a device to view the contents within a certain area or container and track the last time it was updated.\nAttributes:\n    contents: Describes the current contents inside the specified area or container.\n    lastUpdatedTime: Keeps track of the last time the contents were updated or changed.\n\nCommands:\n    refreshAll: This command refreshes the entire contents of the specified area or container.\n        Args:\n            None\n    refresh: This command refreshes a specific file or item within the specified area or container.\n        Args:\n            fileId: Specifies the identification of the file or item to be refreshed.", "samsungce.runestoneHomeContext": "Runestone Home Context: Capability to manage and modify the home environment context within the Runestone system.\nAttributes:\n    supportedContexts: Represents the available contexts that can be set for the home environment.\n\nCommands:\n    setContextSnapshot: Sets a snapshot of the current context for reference or returning to previous state.\n        Args:\n            contextSnapshot: A snapshot of the current context to be stored.\n    setContext: Updates the current context of the home environment.\n        Args:\n            context: The new context to be set for the home environment.\n    setRecentlyUsedApps: Updates the list of recently used apps in the context.\n        Args:\n            recentlyUsedApps: A list of apps that have been recently used in the current context.", "sec.wifiConfiguration": "configureWifi: Allows the device to set up and modify its wifi connection\n    Args:\n        ssid: Network name to be connected\n        password: Password for the specified network\n        securityType: Type of network security (WEP, WPA, WPA2, etc.)\n        frequency: Desired frequency band (2.4GHz or 5GHz)\n        \nCapability: Wifi configuration: This capability allows a device to manage its WiFi settings such as connecting to a network, selecting a frequency band, and configuring security settings. \n\nAttributes:\n    autoReconnection: Indicates whether the device is set to automatically reconnect to the wifi network when connection is lost.\n    minVersion: Specifies the minimum version of the wifi protocol that is supported by the device.\n    supportedWiFiFreq: Lists the frequency bands (like 2.4GHz or 5GHz) that the device can operate in.\n    supportedAuthType: Lists the types of network security (WEP, WPA, WPA2, etc.) that are supported by the device.\n    protocolType: Indicates the type of WiFi protocol (like 802.11n, 802.11ac, etc.) being used by the device.\n\nCommands:\n    configureWifi: Allows the device to set up and modify its wifi connection\n        Args:\n            ssid: The name of the wifi network to connect to.\n            password: The password of the wifi network to connect to.\n            securityType: The type of security used by the wifi network to connect to.\n            frequency: The frequency band of the wifi network to connect to.", "custom.thermostatSetpointControl": "Thermostat Setpoint Control: This capability allows for the control of thermostat setpoints, including setting minimum and maximum temperature limits. \n\nAttributes: \n    minimumSetpoint: This attribute sets the lowest temperature that the thermostat can be set to.\n    maximumSetpoint: This attribute sets the highest temperature that the thermostat can be set to.\n\nCommands:\n    raiseSetpoint: This command increases the current thermostat setpoint.\n        Args:\n            No arguments required for this command. It simply increases the current setpoint.\n\n    lowerSetpoint: This command decreases the current thermostat setpoint.\n        Args:\n            No arguments required for this command. It simply decreases the current setpoint.", "samsungce.weightMeasurement": "Weight Measurement: This capability allows devices to measure and report weight.\nAttributes:\n    weight: Represents the weight measured by the device.\nCommands:\n    No specific commands associated with this capability.", "samsungce.weightMeasurementCalibration": "Weight Measurement Calibration: Capability to calibrate devices that measure weight\nAttributes: \n    No specific attributes associated with this capability.\n\nCommands:\n    zeroCalibrate: Command to reset or calibrate the weight measurement to zero.\n        Args:\n            No specific arguments associated with this command.", "samsungce.connectionState": "Connection State: A capability that reflects the current connection status of a device.\nAttributes:\n    connectionState: Indicates the current connection status of a device (e.g., connected, disconnected).\nCommands:\n    No commands are associated with this capability.", "samsungce.scaleSettings": "Scale Settings: This capability allows for the management of scale settings in a given device.\nAttributes:\n    enabled: This attribute indicates whether the scale settings for the device are currently enabled or not.\nCommands: \n    No commands are available for this capability.", "samsungce.fridgePantryInfo": "Fridge Pantry Info: This capability provides information related to the pantry in a smart fridge.\nAttributes:\n    name: The name of the pantry. It could be a customizable descriptor or a unique identifier for the pantry.\nCommands:\n    No commands available for this capability.", "samsungce.fridgePantryMode": "Fridge Pantry Mode: This capability controls and monitors the pantry mode of a smart fridge.\nAttributes:\n    mode: Indicates the current pantry mode of the fridge.\n    supportedModes: Lists the supported pantry modes that the fridge can operate in.\nCommands:\n    setMode: Sets the pantry mode of the fridge to a specified mode.\n        Args:\n            mode: The mode to set the fridge's pantry to.", "samsungce.meatAging": "Meat Aging: This capability allows the control and monitoring of a device or appliance used for aging meat.\n\nAttributes:\n    zoneInfo: Provides information about different zones in the device where meat aging can be performed.\n    supportedMeatTypes: Lists the types of meat that the device can support for aging.\n    supportedAgingMethods: Lists the different aging methods the device is capable of.\n    status: Indicates the current status of the meat aging process.\n\nCommands:\n    addAging: Initiates a new meat aging process.\n        Args:\n            agingOption: Specifies the options for the aging process, such as meat type, aging method, and duration.\n    cancelAging: Cancels an ongoing meat aging process.\n        Args:\n            id: Identifies the specific aging process to be cancelled.\n    updateAging: Updates the parameters of an ongoing meat aging process.\n        Args:\n            id: Identifies the specific aging process to be updated.\n            agingOption: Specifies the new options for the aging process, such as meat type, aging method, and duration.", "samsungce.foodDefrost": "Food Defrost: This capability allows for the control and monitoring of a device's food defrosting function, often found in microwave ovens or refrigerators with advanced features.\nAttributes:\n    supportedOptions: This attribute lists the options available for defrosting different types of food.\n    foodType: This attribute indicates the type of food that is being defrosted.\n    weight: This attribute represents the weight of the food item that is being defrosted.\n    operationTime: This attribute shows the total time required for the defrosting operation.\n    remainingTime: This attribute displays the remaining time for the defrosting operation to be completed.\nCommands:\n    setDefrost: This command sets the defrosting parameters for the device.\n        Args:\n            foodType: This argument specifies the type of food to be defrosted.\n            weight: This argument sets the weight of the food item to be defrosted.", "custom.dishwasherOperatingProgress": "Dishwasher Operating Progress: This capability provides information about the operational progress of a smart dishwasher.\n\nAttributes:\n    dishwasherOperatingProgress: Indicates the current progress of the dishwasher's operation cycle.\n\nCommands:\n    No specific commands associated with this capability.", "custom.dishwasherOperatingPercentage": "setDishwasherOperatingPercentage\n\nDishwasher Operating Percentage: This capability allows the monitoring and control of a dishwasher's operating percentage.\n\nAttributes:\n    dishwasherOperatingPercentage: Represents the current operating percentage of the dishwasher.\n\nCommands:\n    setDishwasherOperatingPercentage: Sets the dishwasher's operating percentage to a specific value.\n        Args:\n            percentage: The desired operating percentage for the dishwasher.", "custom.dishwasherDelayStartTime": "\"Dishwasher Delay Start Time\": This capability allows setting or checking the delay start time for a dishwasher.\nAttributes:\n    dishwasherDelayStartTime: The delay start time for a dishwasher.\nCommands:\n    setDishwasherDelayStartTime: Sets the delay start time for a dishwasher.\n        Args:\n            dishwasherDelayStartTime: The new delay start time to set for the dishwasher.", "custom.supportedOptions": "supportedOptions: Allows for the identification and utilization of supported options on a device.\nAttributes:\n    referenceTable: Stores a reference table of available options.\n    supportedCourses: Lists courses or paths of action supported by the device.\nCommands:\n    No commands available for this capability.", "samsungce.dishwasherJobState": "startDishwasherJob\nstopDishwasherJob\npauseDishwasherJob\nresumeDishwasherJob\n\nDishwasher Job State: Manages and tracks the operational status of a dishwasher.\nAttributes:\n    scheduledJobs: Provides information about the dishwasher's scheduled jobs.\n    dishwasherJobState: Reports the current operational state of the dishwasher.\n\nCommands:\n    startDishwasherJob: Initiates a dishwasher job.\n    stopDishwasherJob: Halts the current dishwasher job.\n    pauseDishwasherJob: Temporarily pauses the current dishwasher job.\n    resumeDishwasherJob: Resumes a paused dishwasher job.", "samsungce.dishwasherWashingCourse": "Dishwasher Washing Course: This capability allows control and monitoring of the washing courses in a dishwasher.\n\nAttributes:\n    customCourseCandidates: This attribute likely represents the custom washing courses that the user can set on the dishwasher.\n    washingCourse: This attribute represents the current washing course that the dishwasher is running.\n    supportedCourses: This attribute refers to the list of washing courses that the dishwasher supports.\n\nCommands:\n    setWashingCourse: This command sets the dishwasher to a specified washing course.\n        Args:\n            course: The name of the washing course to set.\n    setCustomCourse: This command allows the user to create and set a custom washing course.\n        Args:\n            course: The name of the custom washing course to set.\n    startWashingCourse: This command starts the specified washing course on the dishwasher.\n        Args:\n            course: The name of the washing course to start.\n    startWashingCourseWithOptions: This command starts a specified washing course with additional options.\n        Args:\n            course: The name of the washing course to start.\n            options: Additional options to apply to the washing course.", "samsungce.dishwasherWashingCourseDetails": "setPredefinedCourse\ngetWaterUsage\ngetEnergyUsage\nArgs: \n\nCapability: Dishwasher Washing Course Details: This capability enables the monitoring and control of specific washing course details for a dishwasher, such as predefined courses, maximum water usage, and maximum energy usage.\nAttributes:\n    predefinedCourses: Specifies the predefined washing courses available in the dishwasher.\n    waterUsageMax: Indicates the maximum amount of water usage for the dishwasher.\n    energyUsageMax: Represents the maximum energy consumption for the dishwasher.\n\nCommands:\n    setPredefinedCourse: Sets a specific predefined washing course.\n        Args:\n            courseName: The name of the predefined washing course to be set.\n    getWaterUsage: Retrieves the maximum water usage of the dishwasher.\n        Args:\n            None\n    getEnergyUsage: Retrieves the maximum energy usage of the dishwasher.\n        Args:\n            None", "samsungce.dishwasherOperation": "Dishwasher Operation: This capability allows control and monitoring of a dishwasher's operation\nAttributes:\n    supportedOperatingState: The supported operating states of the dishwasher\n    operatingState: The current operating state of the dishwasher\n    reservable: Indicates whether the dishwasher can be reserved for use at a later time\n    progressPercentage: The percentage of the current operation that has been completed\n    remainingTimeStr: The remaining time for the current operation in string format\n    operationTime: The time of operation\n    remainingTime: The remaining time for the current operation in minutes\n    timeLeftToStart: The time left before the dishwasher starts its operation\nCommands:\n    resume: Command to resume the dishwasher operation\n    cancel: Command to cancel the current dishwasher operation\n        Args:\n            drain: If true, the dishwasher will drain any remaining water\n    setOperatingState: Command to set the operating state of the dishwasher\n        Args:\n            operatingState: The desired operating state to set\n    start: Command to start the dishwasher\n        Args:\n            option: The option for the wash cycle to start\n    startLater: Command to start the dishwasher at a later time\n        Args:\n            delay: The time to delay the start of the dishwasher operation\n    pause: Command to pause the dishwasher operation.", "samsungce.dishwasherWashingOptions": "Capability: Dishwasher Washing Options: This capability represents the different washing options available in a dishwasher.\nAttributes:\n    dryPlus: Indicates the usage of the dry plus feature in the dishwasher.\n    stormWash: Represents the storm wash feature which provides intense cleaning.\n    hotAirDry: Indicates if the hot air dry option is in use.\n    selectedZone: Highlights the selected washing zone in the dishwasher.\n    speedBooster: Indicates the activation of speed booster feature for faster washing.\n    highTempWash: Represents if the high temperature wash option is selected.\n    sanitizingWash: Indicates if the sanitizing wash feature is in use.\n    zoneBooster: Represents the zone booster feature for focused cleaning.\n    addRinse: Shows if an additional rinse cycle has been added.\n    supportedList: Lists all the supported washing options.\n    rinsePlus: Indicates the activation of rinse plus feature for added rinsing.\n    sanitize: Represents if the sanitize option is selected.\n    steamSoak: Indicates if the steam soak feature is in use.\nCommands:\n    setSelectedZone: Sets the selected washing zone in the dishwasher.\n        Args:\n            selectedZone: The zone to be selected.\n    setSanitize: Activates the sanitize feature.\n        Args:\n            sanitize: Boolean value to activate or deactivate sanitize.\n    setZoneBooster: Sets the zone booster feature.\n        Args:\n            zoneBooster: Boolean value to activate or deactivate zone booster.\n    setDryPlus: Activates the dry plus feature.\n        Args:\n            dryPlus: Boolean value to activate or deactivate dry plus.\n    setAddRinse: Adds an additional rinse cycle.\n        Args:\n            addRinse: Boolean value to add or remove additional rinse.\n    setHotAirDry: Activates the hot air dry feature.\n        Args:\n            hotAirDry: Boolean value to activate or deactivate hot air dry.\n    setStormWash: Sets the storm wash feature.\n        Args:\n            stormWash: Boolean value to activate or deactivate storm wash.\n    setHighTempWash: Selects the high temperature wash option.\n        Args:\n            highTempWash: Boolean value to activate or deactivate high temperature wash.\n    setSanitizingWash: Activates the sanitizing wash feature.\n        Args:\n            sanitizingWash: Boolean value to activate or deactivate sanitizing wash.\n    setSpeedBooster: Sets the speed booster feature.\n        Args:\n            speedBooster: Boolean value to activate or deactivate speed booster.\n    setRinsePlus: Activates the rinse plus feature.\n        Args:\n            rinsePlus: Boolean value to activate or deactivate rinse plus.\n    setOptions: Sets the given options.\n        Args:\n            options: The options to be set.\n    setSteamSoak: Activates the steam soak feature.\n        Args:\n            steamSoak: Boolean value to activate or deactivate steam soak.", "samsungce.kidsLock": "Kids Lock: This capability is likely associated with a lock that is specifically designed for children's use or safety.\nAttributes:\n    lockState: Represents the current state of the kids lock, possibly indicating whether it is locked or unlocked.\nCommands:\n    No commands provided for this capability."}
